Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/startup_stm32g474re.s
FillZerobss:
  str  r3, [r2]
  adds r2, r2, #4

LoopFillZerobss:
  cmp r2, r4
  bcc FillZerobss
  
/* end code copied from the STM32cubeIDE startup_stm32g474retx.s file */


/* Call the clock system intitialization function.*/
/*   bl  SystemInit   */
/* Call static constructors */
/*     bl __libc_init_array */
/* Call the application's entry point.*/

/*  bx  init */
      LDR R0, = 0x08000000   // point at bootloader vector table
      LDR R1, = 0
      LDR R2, [R0, R1]      // set SP from bootloader vector table (LDR SP, [R0, #0])
      MOV SP, R2
      DSB                   // Ensure the SP operation is complete
      LDR R0, = init        // point this boot at bootloader
      BX   R0               // Start the bootloader code
 
.size Reset_Handler, .-Reset_Handler


/**
 * @brief  This is the code that gets called when the processor receives an
 *         unexpected interrupt.  This simply enters an infinite loop, preserving
 *         the system state for examination by a debugger.
 *
 * @param  None
 * @retval : None
*/
    .section .text.Default_Handler_IRQ,"ax",%progbits
Default_Handler_IRQ:
Infinite_Loop:
  b Infinite_Loop
  .size Default_Handler_IRQ, .-Default_Handler_IRQ
  
  .section .text.NMI_Handler,"ax",%progbits
NMI_Handler:
Infinite_Loop_NMI_Handler:
  b Infinite_Loop_NMI_Handler
  .size NMI_Handler, .-NMI_Handler
  
  .section .text.HardFault_Handler,"ax",%progbits
HardFault_Handler:
Infinite_Loop_HardFault_Handler:
  b Infinite_Loop_HardFault_Handler
  .size HardFault_Handler, .-HardFault_Handler
  
  .section .text.BusFault_Handler,"ax",%progbits
BusFault_Handler:
Infinite_Loop_BusFault_Handler:
  b Infinite_Loop_BusFault_Handler
  .size BusFault_Handler, .-BusFault_Handler
  
  .section .text.UsageFault_Handler,"ax",%progbits
UsageFault_Handler:
Infinite_Loop_UsageFault_Handler:
  b Infinite_Loop_UsageFault_Handler
  .size UsageFault_Handler, .-UsageFault_Handler
  
  .section .text.SVC_Handler,"ax",%progbits
SVC_Handler:
Infinite_Loop_SVC_Handler:
  b Infinite_Loop_SVC_Handler
  .size SVC_Handler, .-SVC_Handler
  
  .section .text.DebugMon_Handler,"ax",%progbits
DebugMon_Handler:
Infinite_Loop_DebugMon_Handler:
  b Infinite_Loop_DebugMon_Handler
  .size DebugMon_Handler, .-DebugMon_Handler
  
  .section .text.PendSV_Handler,"ax",%progbits
PendSV_Handler:
Infinite_Loop_PendSV_Handler:
  b Infinite_Loop_PendSV_Handler
  .size PendSV_Handler, .-PendSV_Handler
  
  .section .text.WWDG_IRQHandler,"ax",%progbits
WWDG_IRQHandler:
Infinite_Loop_WWDG_IRQHandler:
  b Infinite_Loop_WWDG_IRQHandler
  .size WWDG_IRQHandler, .-WWDG_IRQHandler
  
  .section .text.PVD_PVM_IRQHandler,"ax",%progbits
PVD_PVM_IRQHandler:
Infinite_Loop_PVD_PVM_IRQHandler:
  b Infinite_Loop_PVD_PVM_IRQHandler
  .size PVD_PVM_IRQHandler, .-PVD_PVM_IRQHandler
  
  .section .text.RTC_TAMP_LSECSS_IRQHandler,"ax",%progbits
RTC_TAMP_LSECSS_IRQHandler:
Infinite_Loop_RTC_TAMP_LSECSS_IRQHandler:
  b Infinite_Loop_RTC_TAMP_LSECSS_IRQHandler
  .size RTC_TAMP_LSECSS_IRQHandler, .-RTC_TAMP_LSECSS_IRQHandler
  
  .section .text.RTC_WKUP_IRQHandler,"ax",%progbits
RTC_WKUP_IRQHandler:
Infinite_Loop_RTC_WKUP_IRQHandler:
  b Infinite_Loop_RTC_WKUP_IRQHandler
  .size RTC_WKUP_IRQHandler, .-RTC_WKUP_IRQHandler
  
  .section .text.FLASH_IRQHandler,"ax",%progbits
FLASH_IRQHandler:
Infinite_Loop_FLASH_IRQHandler:
  b Infinite_Loop_FLASH_IRQHandler
  .size FLASH_IRQHandler, .-FLASH_IRQHandler
  
  .section .text.RCC_IRQHandler,"ax",%progbits
RCC_IRQHandler:
Infinite_Loop_RCC_IRQHandler:
  b Infinite_Loop_RCC_IRQHandler
  .size RCC_IRQHandler, .-RCC_IRQHandler
  
  .section .text.EXTI0_IRQHandler,"ax",%progbits
EXTI0_IRQHandler:
Infinite_Loop_EXTI0_IRQHandler:
  b Infinite_Loop_EXTI0_IRQHandler
  .size EXTI0_IRQHandler, .-EXTI0_IRQHandler
  
  .section .text.EXTI1_IRQHandler,"ax",%progbits
EXTI1_IRQHandler:
Infinite_Loop_EXTI1_IRQHandler:
  b Infinite_Loop_EXTI1_IRQHandler
  .size EXTI1_IRQHandler, .-EXTI1_IRQHandler
  
  .section .text.EXTI2_IRQHandler,"ax",%progbits
EXTI2_IRQHandler:
Infinite_Loop_EXTI2_IRQHandler:
  b Infinite_Loop_EXTI2_IRQHandler
  .size EXTI2_IRQHandler, .-EXTI2_IRQHandler
  
  .section .text.EXTI3_IRQHandler,"ax",%progbits
EXTI3_IRQHandler:
Infinite_Loop_EXTI3_IRQHandler:
  b Infinite_Loop_EXTI3_IRQHandler
  .size EXTI3_IRQHandler, .-EXTI3_IRQHandler
  
  .section .text.EXTI4_IRQHandler,"ax",%progbits
EXTI4_IRQHandler:
Infinite_Loop_EXTI4_IRQHandler:
  b Infinite_Loop_EXTI4_IRQHandler
  .size EXTI4_IRQHandler, .-EXTI4_IRQHandler
  
  .section .text.DMA1_Channel1_IRQHandler,"ax",%progbits
DMA1_Channel1_IRQHandler:
Infinite_Loop_DMA1_Channel1_IRQHandler:
  b Infinite_Loop_DMA1_Channel1_IRQHandler
  .size DMA1_Channel1_IRQHandler, .-DMA1_Channel1_IRQHandler
  
  .section .text.DMA1_Channel2_IRQHandler,"ax",%progbits
DMA1_Channel2_IRQHandler:
Infinite_Loop_DMA1_Channel2_IRQHandler:
  b Infinite_Loop_DMA1_Channel2_IRQHandler
  .size DMA1_Channel2_IRQHandler, .-DMA1_Channel2_IRQHandler
  
  .section .text.DMA1_Channel3_IRQHandler,"ax",%progbits
DMA1_Channel3_IRQHandler:
Infinite_Loop_DMA1_Channel3_IRQHandler:
  b Infinite_Loop_DMA1_Channel3_IRQHandler
  .size DMA1_Channel3_IRQHandler, .-DMA1_Channel3_IRQHandler
  
  .section .text.DMA1_Channel4_IRQHandler,"ax",%progbits
DMA1_Channel4_IRQHandler:
Infinite_Loop_DMA1_Channel4_IRQHandler:
  b Infinite_Loop_DMA1_Channel4_IRQHandler
  .size DMA1_Channel4_IRQHandler, .-DMA1_Channel4_IRQHandler
  
  .section .text.DMA1_Channel5_IRQHandler,"ax",%progbits
DMA1_Channel5_IRQHandler:
Infinite_Loop_DMA1_Channel5_IRQHandler:
  b Infinite_Loop_DMA1_Channel5_IRQHandler
  .size DMA1_Channel5_IRQHandler, .-DMA1_Channel5_IRQHandler
  
  .section .text.DMA1_Channel6_IRQHandler,"ax",%progbits
DMA1_Channel6_IRQHandler:
Infinite_Loop_DMA1_Channel6_IRQHandler:
  b Infinite_Loop_DMA1_Channel6_IRQHandler
  .size DMA1_Channel6_IRQHandler, .-DMA1_Channel6_IRQHandler
  
  .section .text.DMA1_Channel7_IRQHandler,"ax",%progbits
DMA1_Channel7_IRQHandler:
Infinite_Loop_DMA1_Channel7_IRQHandler:
  b Infinite_Loop_DMA1_Channel7_IRQHandler
  .size DMA1_Channel7_IRQHandler, .-DMA1_Channel7_IRQHandler
  
  .section .text.ADC1_2_IRQHandler,"ax",%progbits
ADC1_2_IRQHandler:
Infinite_Loop_ADC1_2_IRQHandler:
  b Infinite_Loop_ADC1_2_IRQHandler
  .size ADC1_2_IRQHandler, .-ADC1_2_IRQHandler
  
