Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/startup_stm32g474re.s
  .section .text.USB_HP_IRQHandler,"ax",%progbits
USB_HP_IRQHandler:
Infinite_Loop_USB_HP_IRQHandler:
  b Infinite_Loop_USB_HP_IRQHandler
  .size USB_HP_IRQHandler, .-USB_HP_IRQHandler
  
  .section .text.USB_LP_IRQHandler,"ax",%progbits
USB_LP_IRQHandler:
Infinite_Loop_USB_LP_IRQHandler:
  b Infinite_Loop_USB_LP_IRQHandler
  .size USB_LP_IRQHandler, .-USB_LP_IRQHandler
  
  .section .text.FDCAN1_IT0_IRQHandler,"ax",%progbits
FDCAN1_IT0_IRQHandler:
Infinite_Loop_FDCAN1_IT0_IRQHandler:
  b Infinite_Loop_FDCAN1_IT0_IRQHandler
  .size FDCAN1_IT0_IRQHandler, .-FDCAN1_IT0_IRQHandler
  
  .section .text.FDCAN1_IT1_IRQHandler,"ax",%progbits
FDCAN1_IT1_IRQHandler:
Infinite_Loop_FDCAN1_IT1_IRQHandler:
  b Infinite_Loop_FDCAN1_IT1_IRQHandler
  .size FDCAN1_IT1_IRQHandler, .-FDCAN1_IT1_IRQHandler
  
  .section .text.EXTI9_5_IRQHandler,"ax",%progbits
EXTI9_5_IRQHandler:
Infinite_Loop_EXTI9_5_IRQHandler:
  b Infinite_Loop_EXTI9_5_IRQHandler
  .size EXTI9_5_IRQHandler, .-EXTI9_5_IRQHandler
  
  .section .text.TIM1_BRK_TIM15_IRQHandler,"ax",%progbits
TIM1_BRK_TIM15_IRQHandler:
Infinite_Loop_TIM1_BRK_TIM15_IRQHandler:
  b Infinite_Loop_TIM1_BRK_TIM15_IRQHandler
  .size TIM1_BRK_TIM15_IRQHandler, .-TIM1_BRK_TIM15_IRQHandler
  
  .section .text.TIM1_UP_TIM16_IRQHandler,"ax",%progbits
TIM1_UP_TIM16_IRQHandler:
Infinite_Loop_TIM1_UP_TIM16_IRQHandler:
  b Infinite_Loop_TIM1_UP_TIM16_IRQHandler
  .size TIM1_UP_TIM16_IRQHandler, .-TIM1_UP_TIM16_IRQHandler
  
  .section .text.TIM1_TRG_COM_TIM17_IRQHandler,"ax",%progbits
TIM1_TRG_COM_TIM17_IRQHandler:
Infinite_Loop_TIM1_TRG_COM_TIM17_IRQHandler:
  b Infinite_Loop_TIM1_TRG_COM_TIM17_IRQHandler
  .size TIM1_TRG_COM_TIM17_IRQHandler, .-TIM1_TRG_COM_TIM17_IRQHandler
  
  .section .text.TIM1_CC_IRQHandler,"ax",%progbits
TIM1_CC_IRQHandler:
Infinite_Loop_TIM1_CC_IRQHandler:
  b Infinite_Loop_TIM1_CC_IRQHandler
  .size TIM1_CC_IRQHandler, .-TIM1_CC_IRQHandler
  
  .section .text.TIM2_IRQHandler,"ax",%progbits
TIM2_IRQHandler:
Infinite_Loop_TIM2_IRQHandler:
  b Infinite_Loop_TIM2_IRQHandler
  .size TIM2_IRQHandler, .-TIM2_IRQHandler
  
  .section .text.TIM3_IRQHandler,"ax",%progbits
TIM3_IRQHandler:
Infinite_Loop_TIM3_IRQHandler:
  b Infinite_Loop_TIM3_IRQHandler
  .size TIM3_IRQHandler, .-TIM3_IRQHandler
  
  .section .text.TIM4_IRQHandler,"ax",%progbits
TIM4_IRQHandler:
Infinite_Loop_TIM4_IRQHandler:
  b Infinite_Loop_TIM4_IRQHandler
  .size TIM4_IRQHandler, .-TIM4_IRQHandler
  
  .section .text.I2C1_EV_IRQHandler,"ax",%progbits
I2C1_EV_IRQHandler:
Infinite_Loop_I2C1_EV_IRQHandler:
  b Infinite_Loop_I2C1_EV_IRQHandler
  .size I2C1_EV_IRQHandler, .-I2C1_EV_IRQHandler
  
  .section .text.I2C1_ER_IRQHandler,"ax",%progbits
I2C1_ER_IRQHandler:
Infinite_Loop_I2C1_ER_IRQHandler:
  b Infinite_Loop_I2C1_ER_IRQHandler
  .size I2C1_ER_IRQHandler, .-I2C1_ER_IRQHandler
  
  .section .text.I2C2_EV_IRQHandler,"ax",%progbits
I2C2_EV_IRQHandler:
Infinite_Loop_I2C2_EV_IRQHandler:
  b Infinite_Loop_I2C2_EV_IRQHandler
  .size I2C2_EV_IRQHandler, .-I2C2_EV_IRQHandler
  
  .section .text.I2C2_ER_IRQHandler,"ax",%progbits
I2C2_ER_IRQHandler:
Infinite_Loop_I2C2_ER_IRQHandler:
  b Infinite_Loop_I2C2_ER_IRQHandler
  .size I2C2_ER_IRQHandler, .-I2C2_ER_IRQHandler
  
  .section .text.SPI1_IRQHandler,"ax",%progbits
SPI1_IRQHandler:
Infinite_Loop_SPI1_IRQHandler:
  b Infinite_Loop_SPI1_IRQHandler
  .size SPI1_IRQHandler, .-SPI1_IRQHandler
  
  .section .text.SPI2_IRQHandler,"ax",%progbits
SPI2_IRQHandler:
Infinite_Loop_SPI2_IRQHandler:
  b Infinite_Loop_SPI2_IRQHandler
  .size SPI2_IRQHandler, .-SPI2_IRQHandler
  
  .section .text.USART1_IRQHandler,"ax",%progbits
USART1_IRQHandler:
Infinite_Loop_USART1_IRQHandler:
  b Infinite_Loop_USART1_IRQHandler
  .size USART1_IRQHandler, .-USART1_IRQHandler
  
  .section .text.USART2_IRQHandler,"ax",%progbits
USART2_IRQHandler:
Infinite_Loop_USART2_IRQHandler:
  b Infinite_Loop_USART2_IRQHandler
  .size USART2_IRQHandler, .-USART2_IRQHandler
  
  .section .text.USART3_IRQHandler,"ax",%progbits
USART3_IRQHandler:
Infinite_Loop_USART3_IRQHandler:
  b Infinite_Loop_USART3_IRQHandler
  .size USART3_IRQHandler, .-USART3_IRQHandler
  
  .section .text.RTC_Alarm_IRQHandler,"ax",%progbits
RTC_Alarm_IRQHandler:
Infinite_Loop_RTC_Alarm_IRQHandler:
  b Infinite_Loop_RTC_Alarm_IRQHandler
  .size RTC_Alarm_IRQHandler, .-RTC_Alarm_IRQHandler
  
  .section .text.USBWakeUp_IRQHandler,"ax",%progbits
USBWakeUp_IRQHandler:
Infinite_Loop_USBWakeUp_IRQHandler:
  b Infinite_Loop_USBWakeUp_IRQHandler
  .size USBWakeUp_IRQHandler, .-USBWakeUp_IRQHandler
  
  .section .text.TIM8_BRK_IRQHandler,"ax",%progbits
TIM8_BRK_IRQHandler:
Infinite_Loop_TIM8_BRK_IRQHandler:
  b Infinite_Loop_TIM8_BRK_IRQHandler
  .size TIM8_BRK_IRQHandler, .-TIM8_BRK_IRQHandler
  
  .section .text.TIM8_UP_IRQHandler,"ax",%progbits
TIM8_UP_IRQHandler:
Infinite_Loop_TIM8_UP_IRQHandler:
  b Infinite_Loop_TIM8_UP_IRQHandler
  .size TIM8_UP_IRQHandler, .-TIM8_UP_IRQHandler
  
  .section .text.TIM8_TRG_COM_IRQHandler,"ax",%progbits
TIM8_TRG_COM_IRQHandler:
Infinite_Loop_TIM8_TRG_COM_IRQHandler:
  b Infinite_Loop_TIM8_TRG_COM_IRQHandler
  .size TIM8_TRG_COM_IRQHandler, .-TIM8_TRG_COM_IRQHandler
  
  .section .text.TIM8_CC_IRQHandler,"ax",%progbits
TIM8_CC_IRQHandler:
Infinite_Loop_TIM8_CC_IRQHandler:
  b Infinite_Loop_TIM8_CC_IRQHandler
  .size TIM8_CC_IRQHandler, .-TIM8_CC_IRQHandler
  
  .section .text.ADC3_IRQHandler,"ax",%progbits
ADC3_IRQHandler:
Infinite_Loop_ADC3_IRQHandler:
  b Infinite_Loop_ADC3_IRQHandler
  .size ADC3_IRQHandler, .-ADC3_IRQHandler
  
  .section .text.FMC_IRQHandler,"ax",%progbits
FMC_IRQHandler:
Infinite_Loop_FMC_IRQHandler:
  b Infinite_Loop_FMC_IRQHandler
  .size FMC_IRQHandler, .-FMC_IRQHandler
  
  .section .text.LPTIM1_IRQHandler,"ax",%progbits
LPTIM1_IRQHandler:
Infinite_Loop_LPTIM1_IRQHandler:
  b Infinite_Loop_LPTIM1_IRQHandler
  .size LPTIM1_IRQHandler, .-LPTIM1_IRQHandler
  
  .section .text.TIM5_IRQHandler,"ax",%progbits
TIM5_IRQHandler:
Infinite_Loop_TIM5_IRQHandler:
  b Infinite_Loop_TIM5_IRQHandler
  .size TIM5_IRQHandler, .-TIM5_IRQHandler
  
  .section .text.SPI3_IRQHandler,"ax",%progbits
SPI3_IRQHandler:
Infinite_Loop_SPI3_IRQHandler:
  b Infinite_Loop_SPI3_IRQHandler
  .size SPI3_IRQHandler, .-SPI3_IRQHandler
  
  .section .text.UART4_IRQHandler,"ax",%progbits
UART4_IRQHandler:
Infinite_Loop_UART4_IRQHandler:
  b Infinite_Loop_UART4_IRQHandler
  .size UART4_IRQHandler, .-UART4_IRQHandler
  
  .section .text.UART5_IRQHandler,"ax",%progbits
UART5_IRQHandler:
Infinite_Loop_UART5_IRQHandler:
  b Infinite_Loop_UART5_IRQHandler
  .size UART5_IRQHandler, .-UART5_IRQHandler
  
  .section .text.TIM6_DAC_IRQHandler,"ax",%progbits
TIM6_DAC_IRQHandler:
Infinite_Loop_TIM6_DAC_IRQHandler:
  b Infinite_Loop_TIM6_DAC_IRQHandler
  .size TIM6_DAC_IRQHandler, .-TIM6_DAC_IRQHandler
  
  .section .text.TIM7_DAC_IRQHandler,"ax",%progbits
TIM7_DAC_IRQHandler:
Infinite_Loop_TIM7_DAC_IRQHandler:
  b Infinite_Loop_TIM7_DAC_IRQHandler
  .size TIM7_DAC_IRQHandler, .-TIM7_DAC_IRQHandler
  
  .section .text.DMA2_Channel2_IRQHandler,"ax",%progbits
DMA2_Channel2_IRQHandler:
Infinite_Loop_DMA2_Channel2_IRQHandler:
  b Infinite_Loop_DMA2_Channel2_IRQHandler
  .size DMA2_Channel2_IRQHandler, .-DMA2_Channel2_IRQHandler
  
  .section .text.DMA2_Channel1_IRQHandler,"ax",%progbits
DMA2_Channel1_IRQHandler:
Infinite_Loop_DMA2_Channel1_IRQHandler:
  b Infinite_Loop_DMA2_Channel1_IRQHandler
  .size DMA2_Channel1_IRQHandler, .-DMA2_Channel1_IRQHandler
  
