Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/startup_stm32g474re.s
  .section .text.DMA2_Channel3_IRQHandler,"ax",%progbits
DMA2_Channel3_IRQHandler:
Infinite_Loop_DMA2_Channel3_IRQHandler:
  b Infinite_Loop_DMA2_Channel3_IRQHandler
  .size DMA2_Channel3_IRQHandler, .-DMA2_Channel3_IRQHandler
  
  .section .text.DMA2_Channel4_IRQHandler,"ax",%progbits
DMA2_Channel4_IRQHandler:
Infinite_Loop_DMA2_Channel4_IRQHandler:
  b Infinite_Loop_DMA2_Channel4_IRQHandler
  .size DMA2_Channel4_IRQHandler, .-DMA2_Channel4_IRQHandler
  
  .section .text.DMA2_Channel5_IRQHandler,"ax",%progbits
DMA2_Channel5_IRQHandler:
Infinite_Loop_DMA2_Channel5_IRQHandler:
  b Infinite_Loop_DMA2_Channel5_IRQHandler
  .size DMA2_Channel5_IRQHandler, .-DMA2_Channel5_IRQHandler
  
  .section .text.ADC4_IRQHandler,"ax",%progbits
ADC4_IRQHandler:
Infinite_Loop_ADC4_IRQHandler:
  b Infinite_Loop_ADC4_IRQHandler
  .size ADC4_IRQHandler, .-ADC4_IRQHandler
  
  .section .text.ADC5_IRQHandler,"ax",%progbits
ADC5_IRQHandler:
Infinite_Loop_ADC5_IRQHandler:
  b Infinite_Loop_ADC5_IRQHandler
  .size ADC5_IRQHandler, .-ADC5_IRQHandler
  
  .section .text.UCPD1_IRQHandler,"ax",%progbits
UCPD1_IRQHandler:
Infinite_Loop_UCPD1_IRQHandler:
  b Infinite_Loop_UCPD1_IRQHandler
  .size UCPD1_IRQHandler, .-UCPD1_IRQHandler
  
  .section .text.COMP1_2_3_IRQHandler,"ax",%progbits
COMP1_2_3_IRQHandler:
Infinite_Loop_COMP1_2_3_IRQHandler:
  b Infinite_Loop_COMP1_2_3_IRQHandler
  .size COMP1_2_3_IRQHandler, .-COMP1_2_3_IRQHandler
  
  .section .text.COMP4_5_6_IRQHandler,"ax",%progbits
COMP4_5_6_IRQHandler:
Infinite_Loop_COMP4_5_6_IRQHandler:
  b Infinite_Loop_COMP4_5_6_IRQHandler
  .size COMP4_5_6_IRQHandler, .-COMP4_5_6_IRQHandler
  
  .section .text.COMP7_IRQHandler,"ax",%progbits
COMP7_IRQHandler:
Infinite_Loop_COMP7_IRQHandler:
  b Infinite_Loop_COMP7_IRQHandler
  .size COMP7_IRQHandler, .-COMP7_IRQHandler
  
  .section .text.HRTIM1_Master_IRQHandler,"ax",%progbits
HRTIM1_Master_IRQHandler:
Infinite_Loop_HRTIM1_Master_IRQHandler:
  b Infinite_Loop_HRTIM1_Master_IRQHandler
  .size HRTIM1_Master_IRQHandler, .-HRTIM1_Master_IRQHandler
  
  .section .text.HRTIM1_TIMA_IRQHandler,"ax",%progbits
HRTIM1_TIMA_IRQHandler:
Infinite_Loop_HRTIM1_TIMA_IRQHandler:
  b Infinite_Loop_HRTIM1_TIMA_IRQHandler
  .size HRTIM1_TIMA_IRQHandler, .-HRTIM1_TIMA_IRQHandler
  
  .section .text.HRTIM1_TIMB_IRQHandler,"ax",%progbits
HRTIM1_TIMB_IRQHandler:
Infinite_Loop_HRTIM1_TIMB_IRQHandler:
  b Infinite_Loop_HRTIM1_TIMB_IRQHandler
  .size HRTIM1_TIMB_IRQHandler, .-HRTIM1_TIMB_IRQHandler
  
  .section .text.HRTIM1_TIMC_IRQHandler,"ax",%progbits
HRTIM1_TIMC_IRQHandler:
Infinite_Loop_HRTIM1_TIMC_IRQHandler:
  b Infinite_Loop_HRTIM1_TIMC_IRQHandler
  .size HRTIM1_TIMC_IRQHandler, .-HRTIM1_TIMC_IRQHandler
  
  .section .text.HRTIM1_TIMD_IRQHandler,"ax",%progbits
HRTIM1_TIMD_IRQHandler:
Infinite_Loop_HRTIM1_TIMD_IRQHandler:
  b Infinite_Loop_HRTIM1_TIMD_IRQHandler
  .size HRTIM1_TIMD_IRQHandler, .-HRTIM1_TIMD_IRQHandler
  
  .section .text.HRTIM1_TIME_IRQHandler,"ax",%progbits
HRTIM1_TIME_IRQHandler:
Infinite_Loop_HRTIM1_TIME_IRQHandler:
  b Infinite_Loop_HRTIM1_TIME_IRQHandler
  .size HRTIM1_TIME_IRQHandler, .-HRTIM1_TIME_IRQHandler
  
  .section .text.HRTIM1_FLT_IRQHandler,"ax",%progbits
HRTIM1_FLT_IRQHandler:
Infinite_Loop_HRTIM1_FLT_IRQHandler:
  b Infinite_Loop_HRTIM1_FLT_IRQHandler
  .size HRTIM1_FLT_IRQHandler, .-HRTIM1_FLT_IRQHandler
  
  .section .text.HRTIM1_TIMF_IRQHandler,"ax",%progbits
HRTIM1_TIMF_IRQHandler:
Infinite_Loop_HRTIM1_TIMF_IRQHandler:
  b Infinite_Loop_HRTIM1_TIMF_IRQHandler
  .size HRTIM1_TIMF_IRQHandler, .-HRTIM1_TIMF_IRQHandler
  
  .section .text.CRS_IRQHandler,"ax",%progbits
CRS_IRQHandler:
Infinite_Loop_CRS_IRQHandler:
  b Infinite_Loop_CRS_IRQHandler
  .size CRS_IRQHandler, .-CRS_IRQHandler
  
  .section .text.SAI1_IRQHandler,"ax",%progbits
SAI1_IRQHandler:
Infinite_Loop_SAI1_IRQHandler:
  b Infinite_Loop_SAI1_IRQHandler
  .size SAI1_IRQHandler, .-SAI1_IRQHandler
  
  .section .text.TIM20_BRK_IRQHandler,"ax",%progbits
TIM20_BRK_IRQHandler:
Infinite_Loop_TIM20_BRK_IRQHandler:
  b Infinite_Loop_TIM20_BRK_IRQHandler
  .size TIM20_BRK_IRQHandler, .-TIM20_BRK_IRQHandler
  
  .section .text.TIM20_UP_IRQHandler,"ax",%progbits
TIM20_UP_IRQHandler:
Infinite_Loop_TIM20_UP_IRQHandler:
  b Infinite_Loop_TIM20_UP_IRQHandler
  .size TIM20_UP_IRQHandler, .-TIM20_UP_IRQHandler
  
  .section .text.TIM20_TRG_COM_IRQHandler,"ax",%progbits
TIM20_TRG_COM_IRQHandler:
Infinite_Loop_TIM20_TRG_COM_IRQHandler:
  b Infinite_Loop_TIM20_TRG_COM_IRQHandler
  .size TIM20_TRG_COM_IRQHandler, .-TIM20_TRG_COM_IRQHandler
  
  .section .text.TIM20_CC_IRQHandler,"ax",%progbits
TIM20_CC_IRQHandler:
Infinite_Loop_TIM20_CC_IRQHandler:
  b Infinite_Loop_TIM20_CC_IRQHandler
  .size TIM20_CC_IRQHandler, .-TIM20_CC_IRQHandler
  
  .section .text.FPU_IRQHandler,"ax",%progbits
FPU_IRQHandler:
Infinite_Loop_FPU_IRQHandler:
  b Infinite_Loop_FPU_IRQHandler
  .size FPU_IRQHandler, .-FPU_IRQHandler
  
  .section .text.I2C4_EV_IRQHandler,"ax",%progbits
I2C4_EV_IRQHandler:
Infinite_Loop_I2C4_EV_IRQHandler:
  b Infinite_Loop_I2C4_EV_IRQHandler
  .size I2C4_EV_IRQHandler, .-I2C4_EV_IRQHandler
  
  .section .text.I2C4_ER_IRQHandler,"ax",%progbits
I2C4_ER_IRQHandler:
Infinite_Loop_I2C4_ER_IRQHandler:
  b Infinite_Loop_I2C4_ER_IRQHandler
  .size I2C4_ER_IRQHandler, .-I2C4_ER_IRQHandler
  
  .section .text.SPI4_IRQHandler,"ax",%progbits
SPI4_IRQHandler:
Infinite_Loop_SPI4_IRQHandler:
  b Infinite_Loop_SPI4_IRQHandler
  .size SPI4_IRQHandler, .-SPI4_IRQHandler
  
  .section .text.FDCAN2_IT0_IRQHandler,"ax",%progbits
FDCAN2_IT0_IRQHandler:
Infinite_Loop_FDCAN2_IT0_IRQHandler:
  b Infinite_Loop_FDCAN2_IT0_IRQHandler
  .size FDCAN2_IT0_IRQHandler, .-FDCAN2_IT0_IRQHandler
  
  .section .text.FDCAN2_IT1_IRQHandler,"ax",%progbits
FDCAN2_IT1_IRQHandler:
Infinite_Loop_FDCAN2_IT1_IRQHandler:
  b Infinite_Loop_FDCAN2_IT1_IRQHandler
  .size FDCAN2_IT1_IRQHandler, .-FDCAN2_IT1_IRQHandler
  
  .section .text.FDCAN3_IT0_IRQHandler,"ax",%progbits
FDCAN3_IT0_IRQHandler:
Infinite_Loop_FDCAN3_IT0_IRQHandler:
  b Infinite_Loop_FDCAN3_IT0_IRQHandler
  .size FDCAN3_IT0_IRQHandler, .-FDCAN3_IT0_IRQHandler
  
