Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/startup_stm32g474re.s
  .section .text.FDCAN3_IT1_IRQHandler,"ax",%progbits
FDCAN3_IT1_IRQHandler:
Infinite_Loop_FDCAN3_IT1_IRQHandler:
  b Infinite_Loop_FDCAN3_IT1_IRQHandler
  .size FDCAN3_IT1_IRQHandler, .-FDCAN3_IT1_IRQHandler
  
  .section .text.RNG_IRQHandler,"ax",%progbits
RNG_IRQHandler:
Infinite_Loop_RNG_IRQHandler:
  b Infinite_Loop_RNG_IRQHandler
  .size RNG_IRQHandler, .-RNG_IRQHandler
  
  .section .text.LPUART1_IRQHandler,"ax",%progbits
LPUART1_IRQHandler:
Infinite_Loop_LPUART1_IRQHandler:
  b Infinite_Loop_LPUART1_IRQHandler
  .size LPUART1_IRQHandler, .-LPUART1_IRQHandler
  
  .section .text.I2C3_EV_IRQHandler,"ax",%progbits
I2C3_EV_IRQHandler:
Infinite_Loop_I2C3_EV_IRQHandler:
  b Infinite_Loop_I2C3_EV_IRQHandler
  .size I2C3_EV_IRQHandler, .-I2C3_EV_IRQHandler
  
  .section .text.I2C3_ER_IRQHandler,"ax",%progbits
I2C3_ER_IRQHandler:
Infinite_Loop_I2C3_ER_IRQHandler:
  b Infinite_Loop_I2C3_ER_IRQHandler
  .size I2C3_ER_IRQHandler, .-I2C3_ER_IRQHandler
  
  .section .text.DMAMUX_OVR_IRQHandler,"ax",%progbits
DMAMUX_OVR_IRQHandler:
Infinite_Loop_DMAMUX_OVR_IRQHandler:
  b Infinite_Loop_DMAMUX_OVR_IRQHandler
  .size DMAMUX_OVR_IRQHandler, .-DMAMUX_OVR_IRQHandler
  
  .section .text.QUADSPI_IRQHandler,"ax",%progbits
QUADSPI_IRQHandler:
Infinite_Loop_QUADSPI_IRQHandler:
  b Infinite_Loop_QUADSPI_IRQHandler
  .size QUADSPI_IRQHandler, .-QUADSPI_IRQHandler
  
  .section .text.DMA1_Channel8_IRQHandler,"ax",%progbits
DMA1_Channel8_IRQHandler:
Infinite_Loop_DMA1_Channel8_IRQHandler:
  b Infinite_Loop_DMA1_Channel8_IRQHandler
  .size DMA1_Channel8_IRQHandler, .-DMA1_Channel8_IRQHandler
  
  .section .text.DMA2_Channel6_IRQHandler,"ax",%progbits
DMA2_Channel6_IRQHandler:
Infinite_Loop_DMA2_Channel6_IRQHandler:
  b Infinite_Loop_DMA2_Channel6_IRQHandler
  .size DMA2_Channel6_IRQHandler, .-DMA2_Channel6_IRQHandler
  
  .section .text.DMA2_Channel7_IRQHandler,"ax",%progbits
DMA2_Channel7_IRQHandler:
Infinite_Loop_DMA2_Channel7_IRQHandler:
  b Infinite_Loop_DMA2_Channel7_IRQHandler
  .size DMA2_Channel7_IRQHandler, .-DMA2_Channel7_IRQHandler
  
  .section .text.DMA2_Channel8_IRQHandler,"ax",%progbits
DMA2_Channel8_IRQHandler:
Infinite_Loop_DMA2_Channel8_IRQHandler:
  b Infinite_Loop_DMA2_Channel8_IRQHandler
  .size DMA2_Channel8_IRQHandler, .-DMA2_Channel8_IRQHandler
  
  .section .text.CORDIC_IRQHandler,"ax",%progbits
CORDIC_IRQHandler:
Infinite_Loop_CORDIC_IRQHandler:
  b Infinite_Loop_CORDIC_IRQHandler
  .size CORDIC_IRQHandler, .-CORDIC_IRQHandler
  
  .section .text.FMAC_IRQHandler,"ax",%progbits
FMAC_IRQHandler:
Infinite_Loop_FMAC_IRQHandler:
  b Infinite_Loop_FMAC_IRQHandler
  .size FMAC_IRQHandler, .-FMAC_IRQHandler

  
  
/******************************************************************************
*
* The minimal vector table for a Cortex-M4.  Note that the proper constructs
* must be placed on this to ensure that it ends up at physical address
* 0x0000.0000.
*
******************************************************************************/
 	.section	.isr_vector,"a",%progbits
	.type	g_pfnVectors_b, %object
	.size	g_pfnVectors_b, .-g_pfnVectors_b

/*
g_pfnVectors_mod:
	.word	_estack
	.word	Reset_Handler
	.word	NMI_Handler
	.word	Default_Handler_IRQ  // HardFault_Handler
	.word	Default_Handler_IRQ  // MemManage_Handler
	.word	Default_Handler_IRQ  // BusFault_Handler
	.word	Default_Handler_IRQ  // UsageFault_Handler
	.word	0
	.word	0
	.word	0
	.word	0
	.word	Default_Handler_IRQ  // SVC_Handler
	.word	Default_Handler_IRQ  // DebugMon_Handler
	.word	0
	.word	Default_Handler_IRQ  // PendSV_Handler
	.word	isr_systick       // use routine from init.c
	.word	Default_Handler_IRQ  // WWDG_IRQHandler
	.word	Default_Handler_IRQ  // PVD_PVM_IRQHandler
	.word	Default_Handler_IRQ  // RTC_TAMP_LSECSS_IRQHandler
	.word	Default_Handler_IRQ  // RTC_WKUP_IRQHandler
	.word	Default_Handler_IRQ  // FLASH_IRQHandler
	.word	Default_Handler_IRQ  // RCC_IRQHandler
	.word	Default_Handler_IRQ  // EXTI0_IRQHandler
	.word	Default_Handler_IRQ  // EXTI1_IRQHandler
	.word	Default_Handler_IRQ  // EXTI2_IRQHandler
	.word	Default_Handler_IRQ  // EXTI3_IRQHandler
	.word	Default_Handler_IRQ  // EXTI4_IRQHandler
	.word	Default_Handler_IRQ  // DMA1_Channel1_IRQHandler
	.word	Default_Handler_IRQ  // DMA1_Channel2_IRQHandler
	.word	Default_Handler_IRQ  // DMA1_Channel3_IRQHandler
	.word	Default_Handler_IRQ  // DMA1_Channel4_IRQHandler
	.word	Default_Handler_IRQ  // DMA1_Channel5_IRQHandler
	.word	Default_Handler_IRQ  // DMA1_Channel6_IRQHandler
	.word	Default_Handler_IRQ  // DMA1_Channel7_IRQHandler
	.word	Default_Handler_IRQ  // ADC1_2_IRQHandler
	.word	Default_Handler_IRQ  // USB_HP_IRQHandler
	.word	Default_Handler_IRQ  // USB_LP_IRQHandler
	.word	Default_Handler_IRQ  // FDCAN1_IT0_IRQHandler
	.word	Default_Handler_IRQ  // FDCAN1_IT1_IRQHandler
	.word	Default_Handler_IRQ  // EXTI9_5_IRQHandler
	.word	Default_Handler_IRQ  // TIM1_BRK_TIM15_IRQHandler
	.word	Default_Handler_IRQ  // TIM1_UP_TIM16_IRQHandler
	.word	Default_Handler_IRQ  // TIM1_TRG_COM_TIM17_IRQHandler
	.word	Default_Handler_IRQ  // TIM1_CC_IRQHandler
	.word	Default_Handler_IRQ  // TIM2_IRQHandler
	.word	Default_Handler_IRQ  // TIM3_IRQHandler
	.word	Default_Handler_IRQ  // TIM4_IRQHandler
	.word	Default_Handler_IRQ  // I2C1_EV_IRQHandler
	.word	Default_Handler_IRQ  // I2C1_ER_IRQHandler
	.word	Default_Handler_IRQ  // I2C2_EV_IRQHandler
	.word	Default_Handler_IRQ  // I2C2_ER_IRQHandler
	.word	Default_Handler_IRQ  // SPI1_IRQHandler
	.word	Default_Handler_IRQ  // SPI2_IRQHandler
	.word	Default_Handler_IRQ  // USART1_IRQHandler
	.word	Default_Handler_IRQ  // USART2_IRQHandler
	.word	Default_Handler_IRQ  // USART3_IRQHandler
	.word	Default_Handler_IRQ  // EXTI15_10_IRQHandler
	.word	Default_Handler_IRQ  // RTC_Alarm_IRQHandler
	.word	Default_Handler_IRQ  // USBWakeUp_IRQHandler
	.word	Default_Handler_IRQ  // TIM8_BRK_IRQHandler
	.word	Default_Handler_IRQ  // TIM8_UP_IRQHandler
	.word	Default_Handler_IRQ  // TIM8_TRG_COM_IRQHandler
	.word	Default_Handler_IRQ  // TIM8_CC_IRQHandler
	.word	Default_Handler_IRQ  // ADC3_IRQHandler
	.word	Default_Handler_IRQ  // FMC_IRQHandler
	.word	Default_Handler_IRQ  // LPTIM1_IRQHandler
	.word	Default_Handler_IRQ  // TIM5_IRQHandler
	.word	Default_Handler_IRQ  // SPI3_IRQHandler
	.word	Default_Handler_IRQ  // UART4_IRQHandler
	.word	Default_Handler_IRQ  // UART5_IRQHandler
	.word	Default_Handler_IRQ  // TIM6_DAC_IRQHandler
	.word	Default_Handler_IRQ  // TIM7_DAC_IRQHandler
	.word	Default_Handler_IRQ  // DMA2_Channel1_IRQHandler
	.word	Default_Handler_IRQ  // DMA2_Channel2_IRQHandler
	.word	Default_Handler_IRQ  // DMA2_Channel3_IRQHandler
	.word	Default_Handler_IRQ  // DMA2_Channel4_IRQHandler
	.word	Default_Handler_IRQ  // DMA2_Channel5_IRQHandler
	.word	Default_Handler_IRQ  // ADC4_IRQHandler
	.word	Default_Handler_IRQ  // ADC5_IRQHandler
	.word	Default_Handler_IRQ  // UCPD1_IRQHandler
	.word	Default_Handler_IRQ  // COMP1_2_3_IRQHandler
	.word	Default_Handler_IRQ  // COMP4_5_6_IRQHandler
	.word	Default_Handler_IRQ  // COMP7_IRQHandler
	.word	Default_Handler_IRQ  // HRTIM1_Master_IRQHandler
	.word	Default_Handler_IRQ  // HRTIM1_TIMA_IRQHandler
	.word	Default_Handler_IRQ  // HRTIM1_TIMB_IRQHandler
	.word	Default_Handler_IRQ  // HRTIM1_TIMC_IRQHandler
	.word	Default_Handler_IRQ  // HRTIM1_TIMD_IRQHandler
	.word	Default_Handler_IRQ  // HRTIM1_TIME_IRQHandler
	.word	Default_Handler_IRQ  // HRTIM1_FLT_IRQHandler
	.word	Default_Handler_IRQ  // HRTIM1_TIMF_IRQHandler
	.word	Default_Handler_IRQ  // CRS_IRQHandler
	.word	Default_Handler_IRQ  // SAI1_IRQHandler
	.word	Default_Handler_IRQ  // TIM20_BRK_IRQHandler
	.word	Default_Handler_IRQ  // TIM20_UP_IRQHandler
	.word	Default_Handler_IRQ  // TIM20_TRG_COM_IRQHandler
	.word	Default_Handler_IRQ  // TIM20_CC_IRQHandler
	.word	Default_Handler_IRQ  // FPU_IRQHandler
	.word	Default_Handler_IRQ  // I2C4_EV_IRQHandler
	.word	Default_Handler_IRQ  // I2C4_ER_IRQHandler
	.word	Default_Handler_IRQ  // SPI4_IRQHandler
	.word	0
	.word	Default_Handler_IRQ  // FDCAN2_IT0_IRQHandler
	.word	Default_Handler_IRQ  // FDCAN2_IT1_IRQHandler
	.word	Default_Handler_IRQ  // FDCAN3_IT0_IRQHandler
	.word	Default_Handler_IRQ  // FDCAN3_IT1_IRQHandler
	.word	Default_Handler_IRQ  // RNG_IRQHandler
	.word	Default_Handler_IRQ  // LPUART1_IRQHandler
	.word	Default_Handler_IRQ  // I2C3_EV_IRQHandler
	.word	Default_Handler_IRQ  // I2C3_ER_IRQHandler
	.word	Default_Handler_IRQ  // DMAMUX_OVR_IRQHandler
	.word	Default_Handler_IRQ  // QUADSPI_IRQHandler
	.word	Default_Handler_IRQ  // DMA1_Channel8_IRQHandler
	.word	Default_Handler_IRQ  // DMA2_Channel6_IRQHandler
	.word	Default_Handler_IRQ  // DMA2_Channel7_IRQHandler
	.word	Default_Handler_IRQ  // DMA2_Channel8_IRQHandler
	.word	Default_Handler_IRQ  // CORDIC_IRQHandler
	.word	Default_Handler_IRQ  // FMAC_IRQHandler
*/
 
